# DataBase Name : RSQL
# table Name : score
- id,korean, english, mathmatics

- Anaconda Navigator
- rJava,RMySQL 설치하기

SHOW VARIABLES LIKE 'local_infile';   
SET GLOBAL local_infile = 1;
- 위의 소스를 MySQL에 적어야 데이터를 촤라락 가지고 올수 있다.

In [1]:
library(RMySQL)

Loading required package: DBI

In [26]:
# DB Connection

conn <- dbConnect(MySQL(),
                 dbname ='RSQL',
                 user = 'root',
                 password = 'qwer1234',
                 host ='localhost'
                 )

In [3]:
# 테이블 목록
dbListTables(conn)

[1] "score"

In [4]:
# 테이블의 컬럼 목록
dbListFields(conn,'score')

[1] "id"          "korean"      "english"     "mathematics"

In [5]:
# Select
dbGetQuery(conn,'select count(*) from score')

  count(*)
1 1

In [6]:
dbGetQuery(conn,'select * from score')

  id korean english mathematics
1 1  100    100     100

In [8]:
# insert
dbSendQuery(conn, 'insert into score values (2, 100, 100, 100)')

result = dbGetQuery(conn, 'select * from score')
result

  id korean english mathematics
1 1  100    100     100
2 2  100    100     100

In [10]:
#Update

dbSendQuery(conn, 'update score set korean=90, english=80, mathematics=70 where id=2')

result = dbGetQuery(conn, 'select * from score')
result

  id korean english mathematics
1 1  100    100     100
2 2  90     80      70

In [11]:
#Delete

dbSendQuery(conn, 'delete from score where id=2')

result = dbGetQuery(conn, 'select * from score')
result

  id korean english mathematics
1 1  100    100     100

In [12]:
#Delete

dbSendQuery(conn, 'delete from score')

result = dbGetQuery(conn, 'select * from score')
result

     id korean english mathematics

In [15]:
#csv file을 읽어서 MySQL에 넣기
data<-read.csv("../Data/score.csv", header = F)
colnames(data)<- c('id','korean','english','mathematics')
data

   id korean english mathematics
1   1  90     80      70
2   2  90     88      70
3   3  90     89      70
4   4  90     87      70
5   5  90     60      70
6   6 100    100     100
7   7 100    100     100
8   8 100    100     100
9   9 100    100     100
10 10 100    100     100

In [28]:
dbWriteTable(conn, "score", data, overwrite=T, row.names=F) #append=T

[1] TRUE

In [29]:
result = dbGetQuery(conn, 'select * from score')
result

   id korean english mathematics
1   1  90     80      70
2   2  90     88      70
3   3  90     89      70
4   4  90     87      70
5   5  90     60      70
6   6 100    100     100
7   7 100    100     100
8   8 100    100     100
9   9 100    100     100
10 10 100    100     100

In [30]:
str(result)

'data.frame':	10 obs. of  4 variables:
 $ id         : num  1 2 3 4 5 6 7 8 9 10
 $ korean     : num  90 90 90 90 90 100 100 100 100 100
 $ english    : num  80 88 89 87 60 100 100 100 100 100
 $ mathematics: num  70 70 70 70 70 100 100 100 100 100

In [31]:
data2<-read.csv("../Data/score2.csv", header = F)
colnames(data2)<- c('id','korean','english','mathematics')
data2

  id korean english mathematics
1 11 90     80      70
2 12 90     88      70

In [32]:
dbWriteTable(conn, "score", data2, overwrite=F, row.names=F,append=T)

[1] TRUE

In [33]:
# Disconnect
dbDisconnect(conn)

[1] TRUE